Scam Baiter Website/app/controllers/profile_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."first_name" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["first_name", "Robert"], ["LIMIT", 1]]
INSERT INTO "profiles" ("email", "password", "address", "telephone", "first_name", "last_name", "age", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def view
    profile = Profile.where(first_name: params[:first_name]).first
    if(profile == nil)
      profile = Profile.new
      #For creating users for later
      profile.email = 'robhealless@gmail.com'
      profile.username='jeroen_my_heroin'
      profile.password = 'foobar'
      profile.address = '4 Something lane'
      profile.telephone = '44568487473985'
      profile.first_name = 'Robert'
      profile.last_name = 'Healless'
      profile.age = 20
      profile.gender = 'Male'
      @isNew = profile.new_record?
      profile.save